# телеграмм бот

import telebot
from telebot import types
from buttons import *

TOKEN = '5006276068:AAHzWV1YyrukoIFA19lJ9987bXZg0-2j8V4'

bot = telebot.TeleBot(TOKEN)


@bot.message_handler(commands=['start', 'help'])
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    menubutton1 = types.KeyboardButton('Просмотр статистики')
    menubutton2 = types.KeyboardButton('Сравнение')
    markup.add(menubutton1, menubutton2)
    bot.send_message(message.chat.id, 'Выберите режим работы: \n 1. Просмотр статистики \n 2. Сравнение',
                     reply_markup=markup)


@bot.message_handler(content_types=["text"])
def bot_message(message):
    if message.text == "Просмотр статистики":
        markup = types.ReplyKeyboardMarkup()
        bot.send_message(message.chat.id, "Выберите регион:",reply_markup=markup)
        bot.send_message(message.chat.id, "1. Республика Адыгея (Адыгея)\n "
                                          "2. Республика Алтай\n"
                                          "3. Республика Башкортостан\n"
                                          "4. Республика Бурятия\n"
                                          "5. Республика Дагестан\n"
                                          "6. Республика Ингушетия\n"
                                          "7. Кабардино-Балкарская Республика\n"
                                          "8. Республика Калмыкия\n"
                                          "9. Карачаево-Черкесская Республика\n"
                                          "10. Республика Карелия\n" \
                                          "11. Республика Коми\n" \
                                          "12. Республика Крым\n" \
                                          "13. Республика Марий Эл\n" \
                                          "14. Республика Мордовия\n" \
                                          "15. Республика Саха (Якутия)\n" \
                                          "16. Республика Северная Осетия – Алания\n" \
                                          "17. Республика Татарстан (Татарстан)\n" \
                                          "18. Республика Тыва\n" \
                                          "19. Удмуртская Республика\n" \
                                          "20. Республика Хакасия\n" \
                                          "21. Чеченская Республика\n" \
                                          "22. Чувашская Республика – Чувашия\n" \
                                          "23. Алтайский край\n" \
                                          "24. Забайкальский край\n" \
                                          "25. Камчатский край\n" \
                                          "26. Краснодарский край\n" \
                                          "27. Красноярский край\n" \
                                          "28. Пермский край\n" \
                                          "29. Приморский край\n" \
                                          "30. Ставропольский край\n" \
                                          "31. Хабаровский край\n" \
                                          "32. Амурская область\n" \
                                          "33. Архангельская область\n" \
                                          "34. Астраханская область\n" \
                                          "35. Белгородская область\n" \
                                          "36. Брянская область\n" \
                                          "37. Владимирская область\n" \
                                          "38. Волгоградская область\n" \
                                          "39. Вологодская область\n" \
                                          "40. Воронежская область\n" \
                                          "41. Ивановская область\n" \
                                          "42. Иркутская область\n" \
                                          "43. Калининградская область\n" \
                                          "44. Калужская область\n" \
                                          "45. Кемеровская область\n" \
                                          "46. Кировская область\n" \
                                          "47. Костромская область\n" \
                                          "48. Курганская область\n" \
                                          "49. Курская область\n" \
                                          "50. Ленинградская область\n" \
                                          "51. Липецкая область\n" \
                                          "52. Магаданская область\n" \
                                          "53. Московская область\n" \
                                          "54. Мурманская область\n" \
                                          "55. Нижегородская область\n" \
                                          "56. Новгородская область\n" \
                                          "57. Новосибирская область\n" \
                                          "58. Омская область\n" \
                                          "59. Оренбургская область\n" \
                                          "60. Орловская область\n" \
                                          "61. Пензенская область\n" \
                                          "62. Псковская область\n" \
                                          "63. Ростовская область\n" \
                                          "64. Рязанская область\n" \
                                          "65. Самарская область\n" \
                                          "66. Саратовская область\n" \
                                          "67. Сахалинская область\n" \
                                          "68. Свердловская область\n" \
                                          "69. Смоленская область\n" \
                                          "70. Тамбовская область\n" \
                                          "71. Тверская область\n" \
                                          "72. Томская область\n" \
                                          "73. Тульская область\n" \
                                          "74. Тюменская область\n" \
                                          "75. Ульяновская область\n" \
                                          "76. Челябинская область\n" \
                                          "77. Ярославская область\n" \
                                          "78. Город Москва\n" \
                                          "79. Город Санкт-Петербург\n" \
                                          "80. Город Севастополь\n" \
                                          "81. Еврейская автономная область\n" \
                                          "82. Ненецкий автономный округ\n" \
                                          "83. Ханты-Мансийский автономный округ – Югра\n" \
                                          "84. Чукотский автономный округ\n" \
                                          "85. Ямало-Ненецкий автономный округ\n")




bot.polling()
