# телеграмм бот

import re
import sqlite3
import matplotlib.pyplot as plt
import numpy as np
import telebot
from telebot import types
from buttons import *

TOKEN = '5006276068:AAHzWV1YyrukoIFA19lJ9987bXZg0-2j8V4'
region_lst = ["Республика Адыгея", "Республика Алтай", "Республика Башкортостан", "Республика Бурятия",
              "Республика Дагестан", \
              "Республика Ингушетия", "Кабардино-Балкарская Республика", "Республика Калмыкия",
              "Карачаево-Черкесская Республика", \
              "Республика Карелия", "Республика Коми", "Республика Крым", "Республика Марий Эл", "Республика Мордовия",
              "Республика Саха",
              "Республика Северная Осетия", "Республика Татарстан", "Республика Тыва", "Удмуртская Республика",
              "Республика Хакасия", \
              "Чеченская Республика", "Чувашская Республика", "Алтайский край", "Забайкальский край", "Камчатский край", \
              "Краснодарский край", "Красноярский край", "Пермский край", "Приморский край", "Ставропольский край",
              "Хабаровский край", \
              "Амурская область", "Архангельская область", "Астраханская область", "Белгородская область",
              "Брянская область", \
              "Владимирская область", "Волгоградская область", "Вологодская область", "Воронежская область",
              "Ивановская область", \
              "Иркутская область", "Калининградская область", "Калужская область", "Кемеровская область",
              "Кировская область", \
              "Костромская область", "Курганская область", "Курская область", "Ленинградская область",
              "Липецкая область", \
              "Магаданская область", "Московская область", "Мурманская область", "Нижегородская область",
              "Новгородская область", \
              "Новосибирская область", "Омская область", "Оренбургская область", "Орловская область",
              "Пензенская область", \
              "Псковская область", "Ростовская область", "Рязанская область", "Самарская область",
              "Саратовская область", \
              "Сахалинская область", "Свердловская область", "Смоленская область", "Тамбовская область",
              "Тверская область", \
              "Томская область", "Тульская область", "Тюменская область", "Ульяновская область", "Челябинская область", \
              "Ярославская область", "Москва", "Санкт-Петербург", "Севастополь", "Еврейская автономная область", \
              "Ненецкий автономный округ", "Ханты-Мансийский автономный округ", "Чукотский автономный округ",
              "Ямало-Ненецкий автономный округ"]

conn = sqlite3.connect("dtp_data.db", check_same_thread=False)
cursor = conn.cursor()

bot = telebot.TeleBot(TOKEN)


@bot.message_handler(commands=['start', 'help'])
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    menubutton1 = types.KeyboardButton('Просмотр статистики')
    menubutton2 = types.KeyboardButton('Сравнение')
    markup.add(menubutton1, menubutton2)
    bot.send_message(message.chat.id, 'Выберите режим работы: \n 1. 📈 Просмотр статистики \n 2. 📊 Сравнение',
                     reply_markup=markup)


@bot.message_handler(content_types=["text"])
def bot_message(message):
    global region, region_1, region_2
    if message.text == "Просмотр статистики":
        markup = types.ReplyKeyboardRemove()
        bot.send_message(message.chat.id, "Выберите регион:", reply_markup=markup)
        bot.send_message(message.chat.id, "1. Республика Адыгея\n "
                                          "2. Республика Алтай\n"
                                          "3. Республика Башкортостан\n"
                                          "4. Республика Бурятия\n"
                                          "5. Республика Дагестан\n"
                                          "6. Республика Ингушетия\n"
                                          "7. Кабардино-Балкарская Республика\n"
                                          "8. Республика Калмыкия\n"
                                          "9. Карачаево-Черкесская Республика\n"
                                          "10. Республика Карелия\n"
                                          "11. Республика Коми\n"
                                          "12. Республика Крым\n"
                                          "13. Республика Марий Эл\n"
                                          "14. Республика Мордовия\n"
                                          "15. Республика Саха\n"
                                          "16. Республика Северная Осетия\n"
                                          "17. Республика Татарстан\n"
                                          "18. Республика Тыва\n"
                                          "19. Удмуртская Республика\n"
                                          "20. Республика Хакасия\n"
                                          "21. Чеченская Республика\n"
                                          "22. Чувашская Республика\n"
                                          "23. Алтайский край\n"
                                          "24. Забайкальский край\n"
                                          "25. Камчатский край\n"
                                          "26. Краснодарский край\n"
                                          "27. Красноярский край\n"
                                          "28. Пермский край\n"
                                          "29. Приморский край\n"
                                          "30. Ставропольский край\n"
                                          "31. Хабаровский край\n"
                                          "32. Амурская область\n"
                                          "33. Архангельская область\n"
                                          "34. Астраханская область\n"
                                          "35. Белгородская область\n"
                                          "36. Брянская область\n"
                                          "37. Владимирская область\n"
                                          "38. Волгоградская область\n"
                                          "39. Вологодская область\n"
                                          "40. Воронежская область\n"
                                          "41. Ивановская область\n"
                                          "42. Иркутская область\n"
                                          "43. Калининградская область\n"
                                          "44. Калужская область\n"
                                          "45. Кемеровская область\n"
                                          "46. Кировская область\n"
                                          "47. Костромская область\n"
                                          "48. Курганская область\n"
                                          "49. Курская область\n"
                                          "50. Ленинградская область\n"
                                          "51. Липецкая область\n"
                                          "52. Магаданская область\n"
                                          "53. Московская область\n"
                                          "54. Мурманская область\n"
                                          "55. Нижегородская область\n"
                                          "56. Новгородская область\n"
                                          "57. Новосибирская область\n"
                                          "58. Омская область\n"
                                          "59. Оренбургская область\n"
                                          "60. Орловская область\n"
                                          "61. Пензенская область\n"
                                          "62. Псковская область\n"
                                          "63. Ростовская область\n"
                                          "64. Рязанская область\n"
                                          "65. Самарская область\n"
                                          "66. Саратовская область\n"
                                          "67. Сахалинская область\n"
                                          "68. Свердловская область\n"
                                          "69. Смоленская область\n"
                                          "70. Тамбовская область\n"
                                          "71. Тверская область\n"
                                          "72. Томская область\n"
                                          "73. Тульская область\n"
                                          "74. Тюменская область\n"
                                          "75. Ульяновская область\n"
                                          "76. Челябинская область\n"
                                          "77. Ярославская область\n"
                                          "78. Москва\n"
                                          "79. Санкт-Петербург\n"
                                          "80. Севастополь\n"
                                          "81. Еврейская автономная область\n"
                                          "82. Ненецкий автономный округ\n"
                                          "83. Ханты-Мансийский автономный округ\n"
                                          "84. Чукотский автономный округ\n"
                                          "85. Ямало-Ненецкий автономный округ\n", reply_markup=markup)
    elif message.text in region_lst:
        region = message.text
        bot.send_message(message.chat.id, "Укажите дату в формате YYYY-MM-DD или YYYY-MM или YYYY")
    elif re.fullmatch(r"(\d{4}-\d{1,2}-\d{1,2})", message.text) \
            or re.fullmatch(r"(\d{4}-\d{1,2})", message.text) or re.fullmatch(r"(\d{4})", message.text):
        sql = f"SELECT SUM(dead_count),SUM(injured_count),COUNT(tags) FROM data WHERE region = '{region}' AND datetime LIKE '{message.text}%'"
        cursor.execute(sql)
        a = cursor.fetchall()
        sql = "SELECT category FROM data GROUP BY category ORDER BY COUNT(*) DESC LIMIT 1"
        cursor.execute(sql)
        b = cursor.fetchall()
        sql = "SELECT light FROM data GROUP BY light ORDER BY COUNT(*) DESC LIMIT 1"
        cursor.execute(sql)
        c = cursor.fetchall()
        sql = "SELECT weather FROM data GROUP BY weather ORDER BY COUNT(*) DESC LIMIT 1"
        cursor.execute(sql)
        d = cursor.fetchall()
        bot.send_message(message.chat.id, f"В регионе {region} за {message.text}:\n"
                                          f"Смертность в дтп: {a[0][0]}\n"
                                          f"Раненые: {a[0][1]}\n"
                                          f"Количество дтп: {a[0][2]}\n"
                                          f"Наиболее частый тип дтп: {b[0][0]}\n"
                                          f"Время суток с наибольшим кол-вом дтп: {c[0][0]}\n"
                                          f"В какую погоду больше всего дтп: {d[0][0]}")

    if message.text == "Сравнение":
        markup = types.ReplyKeyboardRemove()
        bot.send_message(message.chat.id, "Выберите регионы для сравнения\n"
                                          "Пример ввода: Москва и Севастополь", reply_markup=markup)
        bot.send_message(message.chat.id, "1. Республика Адыгея\n "
                                          "2. Республика Алтай\n"
                                          "3. Республика Башкортостан\n"
                                          "4. Республика Бурятия\n"
                                          "5. Республика Дагестан\n"
                                          "6. Республика Ингушетия\n"
                                          "7. Кабардино-Балкарская Республика\n"
                                          "8. Республика Калмыкия\n"
                                          "9. Карачаево-Черкесская Республика\n"
                                          "10. Республика Карелия\n"
                                          "11. Республика Коми\n"
                                          "12. Республика Крым\n"
                                          "13. Республика Марий Эл\n"
                                          "14. Республика Мордовия\n"
                                          "15. Республика Саха\n"
                                          "16. Республика Северная Осетия\n"
                                          "17. Республика Татарстан\n"
                                          "18. Республика Тыва\n"
                                          "19. Удмуртская Республика\n"
                                          "20. Республика Хакасия\n"
                                          "21. Чеченская Республика\n"
                                          "22. Чувашская Республика\n"
                                          "23. Алтайский край\n"
                                          "24. Забайкальский край\n"
                                          "25. Камчатский край\n"
                                          "26. Краснодарский край\n"
                                          "27. Красноярский край\n"
                                          "28. Пермский край\n"
                                          "29. Приморский край\n"
                                          "30. Ставропольский край\n"
                                          "31. Хабаровский край\n"
                                          "32. Амурская область\n"
                                          "33. Архангельская область\n"
                                          "34. Астраханская область\n"
                                          "35. Белгородская область\n"
                                          "36. Брянская область\n"
                                          "37. Владимирская область\n"
                                          "38. Волгоградская область\n"
                                          "39. Вологодская область\n"
                                          "40. Воронежская область\n"
                                          "41. Ивановская область\n"
                                          "42. Иркутская область\n"
                                          "43. Калининградская область\n"
                                          "44. Калужская область\n"
                                          "45. Кемеровская область\n"
                                          "46. Кировская область\n"
                                          "47. Костромская область\n"
                                          "48. Курганская область\n"
                                          "49. Курская область\n"
                                          "50. Ленинградская область\n"
                                          "51. Липецкая область\n"
                                          "52. Магаданская область\n"
                                          "53. Московская область\n"
                                          "54. Мурманская область\n"
                                          "55. Нижегородская область\n"
                                          "56. Новгородская область\n"
                                          "57. Новосибирская область\n"
                                          "58. Омская область\n"
                                          "59. Оренбургская область\n"
                                          "60. Орловская область\n"
                                          "61. Пензенская область\n"
                                          "62. Псковская область\n"
                                          "63. Ростовская область\n"
                                          "64. Рязанская область\n"
                                          "65. Самарская область\n"
                                          "66. Саратовская область\n"
                                          "67. Сахалинская область\n"
                                          "68. Свердловская область\n"
                                          "69. Смоленская область\n"
                                          "70. Тамбовская область\n"
                                          "71. Тверская область\n"
                                          "72. Томская область\n"
                                          "73. Тульская область\n"
                                          "74. Тюменская область\n"
                                          "75. Ульяновская область\n"
                                          "76. Челябинская область\n"
                                          "77. Ярославская область\n"
                                          "78. Москва\n"
                                          "79. Санкт-Петербург\n"
                                          "80. Севастополь\n"
                                          "81. Еврейская автономная область\n"
                                          "82. Ненецкий автономный округ\n"
                                          "83. Ханты-Мансийский автономный округ\n"
                                          "84. Чукотский автономный округ\n"
                                          "85. Ямало-Ненецкий автономный округ\n", reply_markup=markup)
    elif re.search(r"(\D и \D)", message.text):
        region_1, region_2 = message.text.split(" и ")
        bot.send_message(message.chat.id, "Введите даты\n"
                                          "Например 2017 и 2021; 2015-09-01 и 2018-03-05")
    elif re.fullmatch(r"(\d{4}-\d{1,2}-\d{1,2}) и (\d{4}-\d{1,2}-\d{1,2})", message.text) \
            or re.fullmatch(r"(\d{4}-\d{1,2}) и (\d{4}-\d{1,2})", message.text) \
            or re.fullmatch(r"(\d{4} и \d{4})", message.text):
        datetime_1, datetime_2 = message.text.split(" и ")
        sql1 = f"SELECT SUM(dead_count),SUM(injured_count),COUNT(tags) FROM data WHERE region = '{region_1}' AND datetime LIKE '{datetime_1}%'"
        cursor.execute(sql1)
        st1 = cursor.fetchall()
        sql2 = f"SELECT SUM(dead_count),SUM(injured_count),COUNT(tags) FROM data WHERE region = '{region_2}' AND datetime LIKE '{datetime_2}%'"
        cursor.execute(sql2)
        st2 = cursor.fetchall()

        bot.send_message(message.chat.id, f"В регионе {region_1} за {datetime_1}:\n"
                                          f"Смертность в дтп: {st1[0][0]}\n"
                                          f"Раненые: {st1[0][1]}\n"
                                          f"Количество дтп: {st1[0][2]}\n"
                                          f"\n"
                                          f"В регионе {region_2} за {datetime_2}:\n"
                                          f"Смертность в дтп: {st2[0][0]}\n"
                                          f"Раненые: {st2[0][1]}\n"
                                          f"Количество дтп: {st2[0][2]}\n")

        labels = ['Кол-во смертей', 'Кол-во раненых', 'Кол-во дтп']

        x = np.arange(len(labels))  # the label locations
        width = 0.35  # the width of the bars

        fig, ax = plt.subplots()
        rects1 = ax.bar(x - width / 2, st1[0], width, label=f'{region_1} {datetime_1}')
        rects2 = ax.bar(x + width / 2, st2[0], width, label=f'{region_2} {datetime_2}')

        ax.set_xticks(x, labels)
        ax.legend(loc='upper left')

        ax.bar_label(rects1, padding=3)
        ax.bar_label(rects2, padding=3)

        fig.tight_layout()
        plt.savefig('img/1.png')

        bot.send_photo(message.chat.id, open("img/1.png", 'rb'))


bot.polling(none_stop=True)
